Revit 2027 API
IPipePressureDropServer.GetInformationLink Method
 The method that Revit will invoke to obtain a URL address which provides more information about the server.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetInformationLink()
Function GetInformationLink As String
String^ GetInformationLink()
abstract GetInformationLink : unit -> string
Return Value
String
 The URL providing server information.
See Also
Reference
IPipePressureDropServer Interface
Autodesk.Revit.DB.Plumbing Namespace